#insert()-ი გამოიყენება ლისთებზე. ჩვენ მისი მეშვეობით შეგვიძლია ჩავამატოთ ელემენტი სასურველ ინდექსზე.

listn = ["erekle", "gio", "luka", "ioane"]
listn.insert(3, "mari")
print(listn)

#pop() ფუნქციაც გამოიყენება ლისთებზე. ჩვენ ამ ფუნქციის გამოყენებით შეგვიძლია ამოვაგდოთ სასურველი ელემენტი ლისთიდან.

listn = ["erekle", "gio", "luka", "ioane"]
listn.pop(0)
print(listn)

#len() ფუნქციაც გამოიყენება ლისთებზე და მისი მეშვეობით შეგვიძლია დავადგინოთ თუ რამდენი ელემნტია ლისთში.

listn = ["erekle", "gio", "luka", "ioane"]
print(len(listn))

#append() ფუნქციაც გამოიყენება ლისთებზე და ამ ფუნქციის გამოყენებით შეგვიძ₾ია ჩავამატოთ ელემენტი ლისთში, მაგრამ ვერ 
#სასურველ ინდექსზე.

listn = ["erekle", "gio", "luka", "ioane"]
listn.append("mari")
print(listn)